uhnp/src/InformationRegisters/тн_Интеграция_ПриоритетыОбработкиСообщенийRMQ/тн_Интеграция_ПриоритетыОбработкиСообщенийRMQ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>тн_Интеграция_ПриоритетыОбработкиСообщенийRMQ</name>
  <comment>Выполнение задач №000040817</comment>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КоличествоФоновыхЗаданий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетодОбработки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмножатьСообщенияПоИсточникам</name>
    <comment>// Чекордина Ирина 06.06.2025 Выполнение задач №000053932</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОбъектовВПотоке</name>
    <comment>// Луконин Е.А. 01.09.2025 Выполнение задач №000054975</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ТипЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Выгрузка</name>
    <comment>// Луконин Е.А. 01.09.2025 Выполнение задач №000054975</comment>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/тн_Интеграция_ПриоритетыОбработкиСообщенийRMQ/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс    

// ~ Луконин Е.А. 01.09.2025 Выполнение задач №000054975 : + Выгрузка
//Процедура ДобавитьТипЗапроса(ТипЗапроса) Экспорт
Процедура ДобавитьТипЗапроса(ТипЗапроса, Выгрузка = Ложь) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.тн_Интеграция_ПриоритетыОбработкиСообщенийRMQ.СоздатьМенеджерЗаписи();
	
	// НАЧАЛО Луконин Е.А. 01.09.2025 Выполнение задач №000054975
	МенеджерЗаписи.Выгрузка = Выгрузка;	
	// КОНЕЦ Луконин Е.А. 01.09.2025 Выполнение задач №000054975
	
	МенеджерЗаписи.ТипЗапроса = ТипЗапроса;	
	МенеджерЗаписи.Прочитать();
	
	Если Не МенеджерЗаписи.Выбран() Тогда
		
		// НАЧАЛО Луконин Е.А. 01.09.2025 Выполнение задач №000054975
		МенеджерЗаписи.Выгрузка = Выгрузка;	
		// КОНЕЦ Луконин Е.А. 01.09.2025 Выполнение задач №000054975
	
		МенеджерЗаписи.ТипЗапроса = ТипЗапроса;
		МенеджерЗаписи.КоличествоФоновыхЗаданий = 1;
		
		МенеджерЗаписи.Записать();
		
	КонецЕсли;
			
КонецПроцедуры // ДобавитьТипЗапроса()

#КонецОбласти

#КонецЕсли
